results/runs/ycsb/2026-05-17T10-16-32/redis/run_workload_d.txt
/opt/java/openjdk/bin/java  -classpath /ycsb/conf:/ycsb/lib/HdrHistogram-2.1.4.jar:/ycsb/lib/core-0.17.0.jar:/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/ycsb/lib/jackson-core-asl-1.9.4.jar:/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/ycsb/redis-binding/lib/commons-pool2-2.4.2.jar:/ycsb/redis-binding/lib/jedis-2.9.0.jar:/ycsb/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -s -P workloads/workloadd -p redis.host=redis -p redis.port=6379 -p recordcount=100000 -p operationcount=100000 -p threadcount=10
Command line: -t -db site.ycsb.db.RedisClient -s -P workloads/workloadd -p redis.host=redis -p redis.port=6379 -p recordcount=100000 -p operationcount=100000 -p threadcount=10
YCSB Client 0.17.0

Loading workload...
Starting test.
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
2026-05-17 10:09:04:825 0 sec: 0 operations; est completion in 0 second 
2026-05-17 10:09:09:019 4 sec: 100000 operations; 23651.84 current ops/sec; [READ: Count=94992, Max=17215, Min=74, Avg=391.57, 90=535, 99=898, 99.9=3127, 99.99=14455] [CLEANUP: Count=10, Max=778, Min=41, Avg=133.5, 90=94, 99=778, 99.9=778, 99.99=778] [INSERT: Count=5008, Max=8991, Min=203, Avg=814.54, 90=1108, 99=1859, 99.9=3941, 99.99=5467] 
[OVERALL], RunTime(ms), 4228
[OVERALL], Throughput(ops/sec), 23651.844843897823
[TOTAL_GCS_G1_Young_Generation], Count, 9
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 32
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.7568590350047304
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 9
[TOTAL_GC_TIME], Time(ms), 32
[TOTAL_GC_TIME_%], Time(%), 0.7568590350047304
[READ], Operations, 94992
[READ], AverageLatency(us), 391.5698058783898
[READ], MinLatency(us), 74
[READ], MaxLatency(us), 17215
[READ], 95thPercentileLatency(us), 611
[READ], 99thPercentileLatency(us), 898
[READ], Return=OK, 94992
[CLEANUP], Operations, 10
[CLEANUP], AverageLatency(us), 133.5
[CLEANUP], MinLatency(us), 41
[CLEANUP], MaxLatency(us), 778
[CLEANUP], 95thPercentileLatency(us), 778
[CLEANUP], 99thPercentileLatency(us), 778
[INSERT], Operations, 5008
[INSERT], AverageLatency(us), 814.5381389776358
[INSERT], MinLatency(us), 203
[INSERT], MaxLatency(us), 8991
[INSERT], 95thPercentileLatency(us), 1242
[INSERT], 99thPercentileLatency(us), 1859
[INSERT], Return=OK, 5008